[
  {
    "_id": "627550cd9beebf0f40e561ac",
    "name": "687 Conselyea Street, Williams, Michigan, 7064",
    "price": "$169.8",
    "quantity": 199,
    "picture": "https://i.ibb.co/PhcGG0K/ga-a320m-s2h-1-500x500.jpg",
    "supplier": "NORALI",
    "email": "lottgray@norali.com",
    "description": "Nulla pariatur sint culpa velit in sit magna. Mollit do nostrud sint eiusmod velit consequat incididunt. Cillum et consectetur quis consequat aliqua officia veniam nisi ex ad incididunt mollit adipisicing. Id ea laborum labore excepteur Lorem dolor ea quis ea nulla adipisicing ullamco.\r\n"
  },
  {
    "_id": "627550cda4fc655d509e032a",
    "name": "182 Brigham Street, Columbus, Oklahoma, 611",
    "price": "$234.4",
    "quantity": 9,
    "picture": "https://i.ibb.co/HGwB8ZW/geforce-gt1030-228x228.jpg",
    "supplier": "POOCHIES",
    "email": "lottgray@poochies.com",
    "description": "Quis enim do duis officia adipisicing voluptate quis consectetur fugiat. Eiusmod pariatur proident nisi adipisicing occaecat incididunt exercitation ex do. Id ut veniam occaecat do in dolore aliquip.\r\n"
  },
  {
    "_id": "627550cd1f38d2c2e9101db1",
    "name": "374 Elm Place, Glenshaw, Arkansas, 9164",
    "price": "$173.0",
    "quantity": 4,
    "picture": "https://i.ibb.co/BzgB1wV/hydro-h45-228x228.jpg",
    "supplier": "EARWAX",
    "email": "lottgray@earwax.com",
    "description": "Enim et ut Lorem quis ullamco enim anim. Adipisicing sit cillum laborum non esse. Culpa mollit velit in irure cupidatat qui anim voluptate.\r\n"
  },
  {
    "_id": "627550cd231d911cd62a1b01",
    "name": "511 Allen Avenue, Hailesboro, Kentucky, 9837",
    "price": "$224.2",
    "quantity": 137,
    "picture": "https://i.ibb.co/WcFRSRX/gt730k-2gd3-v-001-228x228.jpg",
    "supplier": "AUSTECH",
    "email": "lottgray@austech.com",
    "description": "Fugiat consectetur ad nostrud fugiat magna sint ad. Consequat adipisicing magna veniam cillum laborum id et proident enim ad aute duis ex nisi. Velit aliqua enim cupidatat ex dolor quis amet sint. Ex eu laborum elit aute dolor magna qui. Laborum labore veniam laboris laborum amet velit deserunt. Exercitation irure enim in et ex non Lorem nisi commodo in.\r\n"
  },
  {
    "_id": "627550cd223a8bf86e6effb2",
    "name": "942 Chester Street, Motley, Missouri, 8422",
    "price": "$203.3",
    "quantity": 1,
    "picture": "https://i.ibb.co/ySH05rQ/i5-9500-0110-228x228.jpg",
    "supplier": "ECOSYS",
    "email": "lottgray@ecosys.com",
    "description": "Officia cupidatat aute laborum id sint nostrud ut non culpa. Deserunt exercitation nisi duis tempor Lorem dolore consectetur aute minim. Nostrud est laborum dolor magna irure proident ut cillum reprehenderit consectetur. Nostrud proident voluptate excepteur officia minim laboris.\r\n"
  },
  {
    "_id": "627550cd61eb97c762b9ad5f",
    "name": "233 Dakota Place, National, Virginia, 874",
    "price": "$181.7",
    "quantity": 176,
    "picture": "https://i.ibb.co/PjG957B/antec-atom-01-228x228.jpg",
    "supplier": "TEMORAK",
    "email": "lottgray@temorak.com",
    "description": "Eu minim adipisicing fugiat adipisicing. Enim deserunt deserunt consectetur laborum pariatur quis dolore Lorem. Cillum anim incididunt veniam cupidatat. Laboris reprehenderit ex elit adipisicing officia commodo. Irure aliquip commodo veniam cillum. Ad Lorem occaecat proident velit ea ex do ut elit velit aliqua aute.\r\n"
  },
  {
    "_id": "627550cd45dbb4b13c64863b",
    "name": "283 Holmes Lane, Riverton, Idaho, 6117",
    "price": "$239.1",
    "quantity": 0,
    "picture": "https://i.ibb.co/j38f6yr/ryzen-5-pro-4650g-228x228.jpg",
    "supplier": "EARBANG",
    "email": "lottgray@earbang.com",
    "description": "Velit nisi aliqua adipisicing dolore sint sit sit. Sit eu culpa deserunt veniam anim excepteur do ullamco. Do aute aute cillum veniam dolor ea deserunt amet id et adipisicing. In laborum sunt consequat labore irure dolore sunt velit adipisicing. Lorem eu incididunt dolore eu fugiat qui. Ullamco occaecat et velit officia anim laboris exercitation laborum Lorem voluptate est tempor sit.\r\n"
  },
  {
    "_id": "627550cdb612f214a6b17a6e",
    "name": "642 Brevoort Place, Cornucopia, Illinois, 3538",
    "price": "$106.6",
    "quantity": 23,
    "picture": "https://i.ibb.co/ctY7W3g/Western-Digital-1-TB-PURPLE-228x228.jpg",
    "supplier": "RODEOMAD",
    "email": "lottgray@rodeomad.com",
    "description": "Duis est ad et dolor aliqua occaecat nostrud et Lorem. Velit cillum consequat aliquip et amet non tempor officia. Amet commodo deserunt pariatur non id laboris fugiat exercitation. Aliqua ipsum dolor culpa minim.\r\n"
  },
  {
    "_id": "627550cddeaafb2ed99818d3",
    "name": "722 Hoyts Lane, Gadsden, Louisiana, 5167",
    "price": "$292.3",
    "quantity": 3,
    "picture": "https://i.ibb.co/ZMt7hjd/apacer-tex-4gb-ddr4-2666mhz-01-228x228.jpg",
    "supplier": "MOTOVATE",
    "email": "lottgray@motovate.com",
    "description": "Veniam laborum ut non amet duis sint ut eu ad. Aliquip culpa nisi mollit culpa ullamco enim excepteur. Lorem ad cupidatat officia culpa ipsum non nisi dolore irure excepteur velit. Aute est ipsum qui veniam tempor officia proident do excepteur consectetur.\r\n"
  },
  {
    "_id": "627550cd583273c65ac98f27",
    "name": "139 Everett Avenue, Blandburg, Arizona, 4350",
    "price": "$255.7",
    "quantity": 186,
    "picture": "https://i.ibb.co/sJLcfT3/120gb-1-228x228.png",
    "supplier": "JOVIOLD",
    "email": "lottgray@joviold.com",
    "description": "Proident minim aliqua laboris quis ex magna quis commodo officia amet est minim eiusmod. Nisi occaecat aliquip esse aliquip pariatur do sit. Est anim et dolor et nostrud proident do dolore veniam. Labore velit occaecat consequat cupidatat tempor dolor veniam quis non ut eiusmod nostrud adipisicing veniam. Pariatur elit culpa voluptate mollit tempor ut eiusmod est dolor excepteur occaecat. Nulla labore officia mollit nulla velit ea nulla.\r\n"
  },
  {
    "_id": "627550cd04b44c191f5ca08d",
    "name": "382 Abbey Court, Greenock, Rhode Island, 8739",
    "price": "$330.3",
    "quantity": 102,
    "picture": "https://i.ibb.co/Y225y7k/pccooler-halo-fx-120-fan-03-228x228.jpg",
    "supplier": "EYEWAX",
    "email": "lottgray@eyewax.com",
    "description": "Proident amet tempor laborum magna officia sit eu aute. Occaecat elit aliquip ea aliqua do. Duis occaecat reprehenderit ea sit mollit cupidatat ea consectetur do consectetur dolore. Ea velit anim reprehenderit magna quis esse occaecat deserunt. Occaecat qui laborum proident magna incididunt ad sint. Aliqua sint et sit quis dolore Lorem do exercitation ad id irure cillum anim et. Adipisicing magna tempor consequat amet laborum.\r\n"
  },
  {
    "_id": "627550cd57cde262640a4789",
    "name": "441 Bogart Street, Wiscon, Mississippi, 8744",
    "price": "$201.8",
    "quantity": 108,
    "picture": "https://i.ibb.co/KG6Rkdr/redragon-gc-ps002-80-plus-bronze-power-supply-03-228x228.jpg",
    "supplier": "PLASMOX",
    "email": "lottgray@plasmox.com",
    "description": "Exercitation aliquip ipsum anim tempor ipsum esse id commodo aliquip minim. Dolor proident dolor velit minim excepteur adipisicing. Anim nisi adipisicing fugiat quis nisi reprehenderit qui dolor nostrud aliquip ullamco.\r\n"
  }
]